Examples/calculateDevelopedFlow/step2/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];



L1		L_var; //mixingLength
omegap  	omega_var; //specific dissipation rate

internalField   uniform $omegap;

boundaryField
{
    inlet
    {
		type 		turbulentMixingLengthFrequencyInlet; 
		mixingLength      $L1;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ".*"
    {
        type            omegaWallFunction;
        value           $internalField;
    }
}



// ************************************************************************* //
